// note: keep English for Zikronium-specific terms: source, ID, group, event

/* ***** Errors ***** */

/* ProjectAlreadyOpenError */
"ProjectAlreadyOpenError.ErrorDescription" = "Project already open";
"ProjectAlreadyOpenError.RecoverySuggestion" = "Zirkonium3 opens only one project at a time. Please save and close the current project first.";

/* ArchiveProjectNotSavedError */
"ArchiveProjectNotSavedError.ErrorDescription" = "Project not saved";
"ArchiveProjectNotSavedError.RecoverySuggestion" = "Please save before archiving the project.";

/* ArchiveFileAlreadyExistsError */
"ArchiveFileAlreadyExistsError.ErrorDescription" = "Archive file already exists";
"ArchiveFileAlreadyExistsError.RecoverySuggestion" = "Archiving will not overwrite any existing files. Please delete/move \"%@\" or choose a new destination folder.";

/* SourceFileAlreadyExistsError */
"SourceFileAlreadyExistsError.ErrorDescription" = "Cannot add source file";
"SourceFileAlreadyExistsError.RecoverySuggestion" = "\"%@\" already exists in the sources table.";

/* SourceFileNonAudioFileError */
"SourceFileNonAudioFileError.ErrorDescription" = "Not an audio file";
"SourceFileNonAudioFileError.RecoverySuggestion" = "\"%@\" doesn't appear to be an audio file supported by Core Audio.";

/* SourceFileInvalidFileTypeError */
"SourceFileInvalidFileTypeError.ErrorDescription" = "Invalid source file type";
"SourceFileInvalidFileTypeError.RecoverySuggestion" = "Zirkonium3 currently supports uncompressed wav, aiff, and au files only.\n\nIgnoring invalid file(s):\n\n%@";

/* SourceFilePropertyReadError */
"SourceFilePropertyReadError.ErrorDescription" = "Error while reading source file properties";
"SourceFilePropertyReadError.RecoverySuggestion" = "An error occured while reading \"%@\". Please delete it from the sources table and re-add manually.";

/* SourceFileWav32BitIntError */
"SourceFileWav32BitIntError.ErrorDescription" = "Invalid source file property";
"SourceFileWav32BitIntError.RecoverySuggestion" = "Zirkonium3 currently does not support 32 bit integer wav files. Please convert \"%@\" to 32 bit float.";

/* SourceFileMaxChannelsError */
"SourceFileMaxChannelsError.ErrorDescription" = "Invalid source file property";
"SourceFileMaxChannelsError.RecoverySuggestion" = "Zirkonium3 currently does not support source files with 8 channels or more. Please split \"%@\" into separate files.";

/* IDMaxAllowedError */
"IDMaxAllowedError.ErrorDescription" = "Cannot create new ID";
"IDMaxAllowedError.RecoverySuggestion" = "The number of IDs is already at a max of 64.";

/* GroupMaxAllowedError */
"GroupMaxAllowedError.ErrorDescription" = "Cannot create new group";
"GroupMaxAllowedError.RecoverySuggestion" = "The number of groups is already at a max of 16.";

/* GroupDuplicateNameError */
"GroupDuplicateNameError.ErrorDescription" = "Duplicate group name";
"GroupDuplicateNameError.RecoverySuggestion" = "Group names must be unique. Please use another name.";

/* GroupNoMasterIDError */
"GroupNoMasterIDError.ErrorDescription" = "Target group has no master ID";
"GroupNoMasterIDError.RecoverySuggestion" = "Assign a master ID in the group table first.";

/* GroupMasterIDMembershipError */
"GroupMasterIDMembershipError.ErrorDescription" = "Selected ID is not a group member";
"GroupMasterIDMembershipError.RecoverySuggestion" = "The master ID needs to be a member of the group. Add the ID to the group first.";

/* GroupMasterIDRemoveError */
"GroupMasterIDRemoveError.ErrorDescription" = "Master ID cannot be removed";
"GroupMasterIDRemoveError.RecoverySuggestion" = "If you want to remove an ID from a group, assign another ID as a master or delete the Group.\n\nGroup: %@ ID: %@";

/* GroupMirrorModeError */
"GroupMirrorModeError.ErrorDescription" = "Invalid number if IDs for mirror mode";
"GroupMirrorModeError.RecoverySuggestion" = "The number of IDs in a mirror mode group must be 2. Either change the group mode or number of IDs.";

/* EventOverlapError */
"EventOverlapError.ErrorDescription" = "Event overlap detected";
"EventOverlapError.RecoverySuggestion" = "Overlap detected between two events\nTarget: %@ \nEventA - start: %@ end: %@\nEventB - start: %@ end: %@";

/* EventStartBeforeZeroError */
"EventStartBeforeZeroError.ErrorDescription" = "Invalid start time";
"EventStartBeforeZeroError.RecoverySuggestion" = "The start time of an event must be equal to or after 0:00:00.00.";

/* EventNoAssociatedIDError */
"EventNoAssociatedIDError.ErrorDescription" = "Selected event is has no associated ID";
"EventNoAssociatedIDError.RecoverySuggestion" = "Please select an ID for the event before editing the sound path.";

/* EventNoNextEventError */
"EventNoNextEventError.ErrorDescription" = "Next event not found";
"EventNoNextEventError.RecoverySuggestion" = "The selected event is the last event for the target ID or group.";

/* EventNoPreviousEventError */
"EventNoPreviousEventError.ErrorDescription" = "Previous event not found";
"EventNoPreviousEventError.RecoverySuggestion" = "The selected event is the initial event for the target ID or group.";

/* EventInstantTrajectoryError */
"EventInstantTrajectoryError.ErrorDescription" = "Instantaneous Event cannot have a trajectory";
"EventInstantTrajectoryError.RecoverySuggestion" = "An event with no duration is instantaneous and can have only 1 anchor point. Change the start and/or end times of the event before adding trajectory points.";

/* EventNoTargetSelectionError */
"EventNoTargetSelectionError.ErrorDescription" = "Selected event has no target";
"EventNoTargetSelectionError.RecoverySuggestion" = "The selected event is not associated with a specific target, such as an ID or group. Please select a target in the event table before editing sound, motion, or span paths.";

/* EventNoSelectionError */
"EventNoSelectionError.ErrorDescription" = "No event selected";
"EventNoSelectionError.RecoverySuggestion" = "Please select an event before editing.";

/* EventMultipleSelectionError*/
"ZirkEventMultipleSelectionError.ErrorDescription" = "Multiple events selected";
"ZirkEventMultipleSelectionError.RecoverySuggestion" = "Zirkonium3 is unable to execute requested operation on multiple events simultaneously. Please select a single event.";

/* EventMarkerSelectionError */
"EventMarkerSelectionError.ErrorDescription" = "Marker event selected";
"EventMarkerSelectionError.RecoverySuggestion" = "Zirkonium3 is unable to execute requested operation on a marker event. Please select another event.";

/* XMLReadError */
"XMLReadError.ErrorDescription" = "Could not read XML \"%@\"";
"XMLReadError.RecoverySuggestion" = ""; // replaced by actual error suggestion

/* XMLParseExceptionError */
"XMLParseExceptionError.ErrorDescription" = "Could not read XML \"%@\"";
"XMLParseExceptionError.RecoverySuggestion" = "Exception thrown while parsing XML:\n\n%@";

/* XMLWriteError */
"XMLWriteError.ErrorDescription" = "Could not write XML \"%@\"";
"XMLWriteError.RecoverySuggestion" = ""; // replaced by actual error suggestion

/* SpeakerSetupNotLoadedError */
"SpeakerSetupNotLoadedError.ErrorDescription" = "No speakers loaded";
"SpeakerSetupNotLoadedError.RecoverySuggestion" = "Please load a speaker setup by selecting \"Load Speaker Setup\" in the File menu.";

/* SpeakerSetupInvalidRootError */
"SpeakerSetupInvalidRootError.ErrorDescription" = "Invalid speaker setup XML syntax";
"SpeakerSetupInvalidRootError.RecoverySuggestion" = "The root XML element must be \"SpeakerSetup\". Is this a speaker setup file?";

/* SpeakerSetupNoDimensionError */
"SpeakerSetupNoDimensionError.ErrorDescription" = "Invalid speaker setup XML syntax";
"SpeakerSetupNoDimensionError.RecoverySuggestion" = "The speaker setup dimension (2 or 3) is not specified in the XML file.";

/* SpeakerSetupInvalidDimensionError */
"SpeakerSetupInvalidDimensionError.ErrorDescription" = "Invalid speaker setup XML syntax";
"SpeakerSetupInvalidDimensionError.RecoverySuggestion" = "The speaker setup dimension must be 2 or 3.";

/* AutoEventCreationNoTargetError */
"AutoEventCreationNoTargetError.ErrorDescription" = "No target defined";
"AutoEventCreationNoTargetError.RecoverySuggestion" = "Please create at least one ID or group in the IDs/Groups tab.";

/* AutoEventCreationNoSourceFilesError */
"AutoEventCreationNoSourceFilesError.ErrorDescription" = "No source files";
"AutoEventCreationNoSourceFilesError.RecoverySuggestion" = "Import at least one source file to use auto event creation.";

/* AutoEventCreationInvalidTimeError */
"AutoEventCreationInvalidTimeError.ErrorDescription" = "Invalid time range";
"AutoEventCreationInvalidTimeError.RecoverySuggestion" = "Start time is before the end time or times are not within the source file's duration.";

/* NetworkConnectionError */
"NetworkConnectionError.ErrorDescription" = "Network not connected";
"NetworkConnectionError.RecoverySuggestion" = "Please check the computer's network settings and try again.";

/* NetworkInvalidAddressError */
"NetworkInvalidAddressError.ErrorDescription" = "Invalid networking address or hostname.";
"NetworkInvalidAddressError.RecoverySuggestion" = ""; // not used by formatter error alert

/* NetworkInvalidPortError */
"NetworkInvalidPortError.ErrorDescription" = "Networking port values must be integers within the range 1024 to 65534.";
"NetworkInvalidPortError.RecoverySuggestion" = ""; // not used by formatter error alert

/* NetworkPortInUseError */
"NetworkPortInUseError.ErrorDescription" = "Network UDP port error";
"NetworkPortInUseError.RecoverySuggestion" = "Zirkonium3 was unable to open UDP port %d. The port may be in use by another application. Either close the application or choose a free port number >= 1024.";

/* OSCInvalidAddressPatternError */
"OSCInvalidAddressPatternError.ErrorDescription" = "OSC address pattern must start with a / and cannot contain #*,?[]{} or space.";
"OSCInvalidAddressPatternError.RecoverySuggestion" = ""; // not used by formatter error alert

/* ZirkZirkPadSenderError */
"ZirkPadSenderError.ErrorDescription" = "No ZirkPad OSC sender found";
"ZirkPadSenderError.RecoverySuggestion" = "Syncing to ZirkPad requires at least one OSC Sender with ZirkPad sending enabled in the Network Preferences.";

/* ZirkZirkPadAddressError */
"ZirkPadAddressError.ErrorDescription" = "ZirkPad network host address error";
"ZirkPadAddressError.RecoverySuggestion" = "Syncing requires sending a non-localhost network address of this system to ZirkPad, however none were found. Is your WiFi off or network cable unplugged?";

/* ManualNotFoundError */
"ManualNotFoundError.ErrorDescription" = "Zirkonium3 Manual.pdf not found";
"ManualNotFoundError.RecoverySuggestion" = "The manual should be located in the same folder as the Zirkonium3.app. Are you running Zirkonium from a different location?";

/* DummyError */
// dummy error to suppress default dialogs and should not be seen by the user
"DummyError.ErrorDescription" = "Dummy error";
"DummyError.RecoverySuggestion" = "";

/* ***** Warnings ***** */

/* UnsavedChangesWarning */
"UnsavedChangesOldToNewWarning.ErrorDescription" = "Do you want to save the changes you made to \"%@\" before opening \"%@\"?";
"UnsavedChangesOldToNewWarning.RecoverySuggestion" = "Your changes will be lost if you don’t save them.";

/* MigrationWarning */
"MigrationWarning.ErrorDescription" = "Update \"%@\"?";
"MigrationWarning.RecoverySuggestion" = "\"%@\" was created by an older Zirkonium and needs to be updated for version %@.\n\nThis process cannot be reversed and \"%@\" may or may not be readable by older Zirkoniums. If you want to keep the project as is, use Duplicate to create a new copy.";

/* TestStartWarning */
"TestStartWarning.ErrorDescription" = "Are you sure?";
"TestStartWarning.RecoverySuggestion" = "Zirkonium3 will generate white noise for testing. Please select the test menu again in order to stop the test sound.";

/* SampleRateDoesNotMatchWarning */
"SampleRateDoesNotMatchWarning.ErrorDescription" = "Sample rate does not match";
"SampleRateDoesNotMatchWarning.RecoverySuggestion" = "The sample rate of some source files does not match the audio sample rate. Playback pitch will be affected.";

/* SourceFileSampleRateWarning */
"SourceFileSampleRateWarning.ErrorDescription" = "Sample rate of Source File does not match project";
"SourceFileSampleRateWarning.RecoverySuggestion" = "The sample rate of %d which you are associating with an ID does not match the sample rate of the project. Playback pitch will be affected.";

/* GroupMasterIDDeleteWarning */
"GroupMasterIDDeleteWarning.ErrorDescription" = "Deleting Group Master IDs";
"GroupMasterIDDeleteWarning.RecoverySuggestion" = "One or more IDs you are trying to delete are Group master IDs. Delete associated Groups?\n\n%@";

/* EventStartEndOrderWarning */
"EventStartEndOrderWarning.ErrorDescription" = "Start or end time out of order";
"EventStartEndOrderWarning.RecoverySuggestion" = "An event's end time must be after it's start time. Move start or end time to shift event or swap start & end times?\n\nTarget: %@\nEvent - start: %g end: %g\n\nMove - start: %g end: %g\n\tor\nSwap - start: %g end: %g";

/* EventOverlapRevertWarning */
"EventOverlapRevertWarning.ErrorDescription" = "Overlap(s) detected";
"EventOverlapRevertWarning.RecoverySuggestion" = "All overlapped events were reverted.";

/* EventTrajectoryToMarkerWarning */
"EventTrajectoryToMarkerWarning.ErrorDescription" = "Are you sure?";
"EventTrajectoryToMarkerWarning.RecoverySuggestion" = "You are changing the event into a marker event which require's clearing it's trajectory and end time.";

/* SpeakerSetupLoadWarning */
"SpeakerSetupLoadWarning.ErrorDescription" = "Are You Sure?";
"SpeakerSetupLoadWarning.RecoverySuggestion" = "The audio output routing settings are linked to the speaker setup. Loading a new speaker setup may change the current output settings.";

/* SpeakerSetup2DRingsWarning */
"SpeakerSetup2DRingsWarning.ErrorDescription" = "Possibly invalid dimension";
"SpeakerSetup2DRingsWarning.RecoverySuggestion" = "The speaker setup is 2 dimensional, however there are multiple rings. This may lead to incorrect speaker triplet placement.\n\nOne possible fix is to change the setup to 3D and add elevation steps to the inner rings.";

/* SpeakerSetup3DFlatWarning */
"SpeakerSetup3DFlatWarning.ErrorDescription" = "Possibly invalid dimension";
"SpeakerSetup3DFlatWarning.RecoverySuggestion" = "The speaker setup is 3 dimensional, however all speaker elevations are 0 degrees and this may lead to \"holes\" in certain areas.\n\nFall back to 2 dimensions?";

/* MK1NoObjectsWarning */
"MK1NoObjectsWarning.ErrorDescription" = "MK1 XML not imported";
"MK1NoObjectsWarning.RecoverySuggestion" = "No \"object\" elements were found in the XML. Is this a MK1 file?";

/* MK1SummaryWarning */
"MK1SummaryWarning.ErrorDescription" = "MK1 XML import warnings";
"MK1SummaryWarning.RecoverySuggestion" = "Importing %@ was successful with the following warnings:\n\n%@";

/* ***** Menus ***** */

"Start Test" = "Start Test";
"Stop Test" = "Stop Test";

/* ***** Buttons ***** */

/* alert buttons */
"Untitled" = "Untitled";
"Save" = "Save";
"Don't Save" = "Don't Save";
"Cancel" = "Cancel";
"Update" = "Update";
"Duplicate" = "Duplicate";

/* quick manipulator */
"Shift" = "Shift";
"Scale" = "Scale";
"Copy" = "Copy";
"forward" = "forward";
"backward" = "backward";
"equally" = "equally";
"start time" = "start time";
"end time" = "end time";
"start & end" = "start & end";
"after" = "after";
"before" = "before";
"Move End" = "Move End";
"Move Start" = "Move Start";
"Cancel" = "Cancel";

/* ***** Audio ***** */

/* Portaudio */
"Portaudio error" = "Portaudio error";

/* JACK */
"JACK error" = "JACK error";
"JACK server error" = "JACK server error";
"Unable to connect. Is the server running?" = "Unable to connect. Is the server running?";
"Unable to connect to JACK server." = "Unable to connect to JACK server.";
"You will need to restart the server & reconnect Zirkonium3." = "You will need to restart the server & reconnect Zirkonium3.";

/* ***** Panels ***** */

"LoadSpeakerSetupPanel.message" = "Select a speaker setup XML file to load.\n\nSupported formats are Zirkonium MK2 and MK3 (Relative & Metric).\n";
"ExportSpeakerSetupPanel.message" = "Export current speaker setup to an XML file.\n\nNote: Positions are saved as relative (non-metric) and audio output routing is preserved.\n";

"MK1ImportPanel.message" = "Select a Zirkonium MK1 file. All required source files must be placed in the same folder. This may take some time to complete.\n\nWARNING: Importing MK1 projects is currently experimental. Not all trajectories, groups, or source files may import correctly.\n";

"BouncePanel.message" = "Bounce project to 24-bit wav files. Choose destination folder for output files.\n\nOutput will be current speaker channels \"FILENAME #.wav\"\nor a single stereo file if HRTF is enabled \"FILENAME hrtf.wav\".\n\nOverwrites existing files. This may take some time to complete.";
"BouncePanel.name" = "FILENAME: ";

"ArchivePanel.message" = "Archive the project by copying the project file and all source files. Choose destination folder.\n\nNote: This will save the current document as part of the process.\n";

"AddSourceFilePanel.message" = "Select source sound files to add.\n\nSound files must be uncompressed wav, aiff, or au with a max of 8 channels.\n";

"SourcesMenu.ChangeSourceFile" = "Select new source file to replace the current sources table selection\n";
"SourcesMenu.LocateMissingFiles" = "Select a folder to search for missing files in the sources table. Any files with matching file names will be reloaded.\n";

/* ***** Motion View Add Point Popup ***** */

/* title */
"Add Point" = "Add Point";
"Edit Point" = "Edit Point";

"Start - End" = "Start - End";
"Prev - Next" = "Prev - Next";

"Motion Value" = "Motion Value";
"Start Pos - End Pos";

"Span Value" = "Span Value";
"Min - Max" = "Min - Max";

"Gain Value" = "Gain Value";
"Silent - Double" = "Silent - Double";

/* button */
"Add" = "Add";
